package task10;
//         Напишите метод,
//         который принимает две строки в качестве входящих параметров,
//         объединяет их друг с другом
//         и результат выводит в консоль в обратном порядке.



public class Main1 {
    public static void main(String[] args) {
        String s1 = new String("print");
        String s2 = "copy";
        System.out.println(s2.concat(s1));


    }
}
